[{"num":0,"Record Name":"Hail risk","Title":"Goodness, gracious, great balls of HAIL","Authors":"Jeff Chen, Star Ying, Ed Kearns","Author Organization":"Commerce Data Service","Editors":"Jeff Chen, Star Ying","Editor Organization":"Commerce Data Service","Short Description":"Imagine baseball sized balls of ice raining down. Where and when does it happen? ","Long Description":"For some Americans, this is a real weather phenomenon that risks the physical well-being of people and property. But how often does it happen? Where do these events normally happen? As it turns out, the National Oceanic and Atmospheric Administration (NOAA) collects massive amounts of data on precipitation using radar stations across the country. ","Software":"R with Google Charts and Leaflet.js integration","Dataset":"NOAA Severe Weather Data Inventory (SWDI); US Census Bureau County Shapefiles (TIGER)","Collaboration":"This work was made possible by the collaboration and support of NOAA's National Centers for Environmental Information (NCEI).","Tutorial":"http:\/\/commercedataservice.github.io\/tutorial_noaa_hail\/","Unnamed: 13":null,"Unnamed: 14":null,"Unnamed: 15":null,"Unnamed: 16":null},{"num":1,"Record Name":"NVD cybersecurity","Title":"Making sense of cybersecurity patterns","Authors":"Star Ying","Author Organization":"Commerce Data Service, NIST","Editors":"Tyrone Grandison, Jeff Chen","Editor Organization":"Commerce Data Service","Short Description":"How often are the vulnerabilities being discovered, exploited, or patched in the software that powers our lives? ","Long Description":"That's the question Americans ask themselves daily. What is a good tradeoff between convenience and security when everything we use seems to require constant updates? How often are the vulnerabilities being discovered, exploited, or patched in the software that powers our lives? How much are we putting ourselves at risk when we ignore our updates? This tutorial uses cybersecurity data from the National Institute of Standards and Technology's (NIST) to uncover vulnerability patterns across the tech world.","Software":"Python, D3.js, Dimple.js, dygraphs, Gephi","Dataset":"NIST's National Vulnerabilities Database (NVD)","Collaboration":"This work was made possible with the technical review conducted by NIST (NVD)","Tutorial":"http:\/\/commercedataservice.github.io\/tutorial_nist_nvd\/","Unnamed: 13":null,"Unnamed: 14":null,"Unnamed: 15":null,"Unnamed: 16":null},{"num":2,"Record Name":"viirs part 1","Title":"Nighttime satellite imagery for economic research (Part 1)","Authors":"Jeff Chen","Author Organization":"Commerce Data Service, NOAA","Editors":"Star Ying","Editor Organization":"Commerce Data Service","Short Description":"VIIRS nighttime satellite imagery unlocks new opportunities to track economic and population patterns.","Long Description":"Everytime a satellite passes over is an opportunity to improve our understanding of society in near real time. The various imagery captures different bandwidths of light, enabling a wide range of scientific and operational capabilities. In particular, nighttime satellite data can be transformed into approximations of economic activity as well as population patterns. In this first part in a multiple part series, we will illustrate how to process monthly satellite imagery composites from NOAA to correlate with population data from the US Census Bureau. ","Software":"R, Plotly","Dataset":"VIIRS Day\/Night Band (DNB) Cloud Free Monthly Composites (VIIRS DNB); US Census Bureau County Shapefiles (TIGER) ","Collaboration":"This work was inspired and developed in collaboration with NOAA's National Centers for Environmental Information (NCEI).","Tutorial":"http:\/\/commercedataservice.github.io\/tutorial_viirs_part1\/","Unnamed: 13":null,"Unnamed: 14":null,"Unnamed: 15":null,"Unnamed: 16":null},{"num":3,"Record Name":"acs nonprofits","Title":"Extending the ACS: Data-Driven Outreach","Authors":"Star Ying","Author Organization":"Commerce Data Service","Editors":"Tyrone Grandison, Jeff Chen","Editor Organization":"Commerce Data Service","Short Description":"The American Community Survey can be used to help plan data-driven outreach for organizations on a budget.","Long Description":"Providing an unprecedented glimpse of societal well-being, the American Community Survey (ACS) is one of the highest value datasets produced by the U.S. Census Bureau. This dataset enables socioeconomic research, informs urban planning efforts among others, but it can also used for applied efforts to help non-profits focus their outreach to provide public services. This tutorial illustrates how ACS data can be used to identify areas that may benefit from services. ","Software":"Python, D3.js, Leaflet.js, Leaflet-omnivore.js, TopoJSON.js, GeoJSON-VT.js and Dimple.js ","Dataset":"ACS estimates (Tract and Block GroupLevel), ACS Geography Files, and the Census tract shapefiles. .","Collaboration":null,"Tutorial":"http:\/\/commercedataservice.github.io\/tutorial_acs_rank\/","Unnamed: 13":null,"Unnamed: 14":null,"Unnamed: 15":null,"Unnamed: 16":null},{"num":4,"Record Name":"earthgenome","Title":"Environmental Data for Decision Making","Authors":"Dan Hammer\/Chief Data Scientist","Author Organization":"Earth Genome","Editors":"Jeff Chen","Editor Organization":"Commerce Data Service","Short Description":"Topography data powers smart investments in environmental and telecommunications infrastructure.","Long Description":"Open environmental data can be viewed as infrastructure for society: the data is available to the public and can be meaningfully used to understand nature-based solutions to environmental issues. Earth Genome, an environmental nonprofit, has built an Green Infrastructure Support Tool (GIST) on top of open environmental data to help businesses understand investment decisions involving \"green\" infrastructure. Among the data that drives this tool is NOAAճ topography data Ѡa fundamental element in their wetlands restoration model for informing industrial investment decisions that support not only bottom line for manufacturing but the environment. This data is critical for everything from hydrology, risk management, construction planning, and telecommunications. In this tutorial, Earth Genome and the Commerce Data Service demonstrate how to manipulate and visualize topography data. ","Software":"R, Plotly","Dataset":"NOAA GLOBE Digital Elevation Model (NOMADS) ","Collaboration":null,"Tutorial":null,"Unnamed: 13":null,"Unnamed: 14":null,"Unnamed: 15":null,"Unnamed: 16":null},{"num":5,"Record Name":"mapbox pwat part1","Title":"Weather Data for Web Maps: Part 1","Authors":"Damon Burgett","Author Organization":"Mapbox","Editors":"Jeff Chen","Editor Organization":"Commerce Data Service","Short Description":"Precipitable Water (Pwat) helps meteorologists understand the available moisture - fuel for storms - in the atmosphere. ","Long Description":"Precipitable Water (Pwat) helps meteorologists understand the available moisture - fuel for storms - in the atmosphere. When visualized, the complex swirling and eddying patterns bring alive atmospheric processes, and are a beautiful liquid analog to the more esoteric variable that they describe. Combining this data with reference information - coastlines, political borders, and terrain - helps to paint a clearer picture of earth surface and atmospheric interactions on our planet. In collaboration with the Commerce Data Service, Mapbox has created this first installment in a two part tutorial that will guide you though processing and visualizing weather data.","Software":"bash, GDAL, rasterio, gribdoctor, Mapbox Studio","Dataset":"NOAA National Operational Model Archive and Distribution System (NOMADS) ","Collaboration":null,"Tutorial":"http:\/\/commercedataservice.github.io\/tutorial_mapbox_part1\/","Unnamed: 13":null,"Unnamed: 14":null,"Unnamed: 15":null,"Unnamed: 16":null},{"num":6,"Record Name":"mapbox pwat part2","Title":"Weather Data for Web Maps: Part 2","Authors":"Damon Burgett, Charlie Loyd","Author Organization":"Mapbox","Editors":"Jeff Chen","Editor Organization":"Commerce Data Service","Short Description":"Building upon the first tutorial in a two part series, Mapbox demonstrates how to animate Precipitable Water (PWAT) data from NOAA's global weather forecasts. ","Long Description":"Building upon the first tutorial in a two part series, Mapbox demonstrates how to animate Precipitable Water (PWAT) data from NOAA's global weather forecasts. This tutorial brings the data to life, showing the fluidity of an atmospheric variable that is crucial for understanding the environment. In collaboration with the Commerce Data Service, Mapbox has created this first installment in a two part tutorial that will guide you though processing and visualizing weather data.","Software":"bash, GDAL, rasterio, gribdoctor, Mapbox Studio","Dataset":"NOAA National Operational Model Archive and Distribution System (NOMADS) ","Collaboration":null,"Tutorial":"http:\/\/commercedataservice.github.io\/tutorial_mapbox_part2","Unnamed: 13":null,"Unnamed: 14":null,"Unnamed: 15":null,"Unnamed: 16":null},{"num":7,"Record Name":"zillow","Title":null,"Authors":"Aaron Terazas","Author Organization":"Zillow","Editors":"Star Ying, Jeff Chen ","Editor Organization":"Commerce Data Service","Short Description":"When it comes to buying a house, there is a lot more to consider than just the sticker price. ","Long Description":"When it comes to buying a house, there is a lot more to consider than just the sticker price. Wages and salaries vary widely across the country, including within specific occupations, as does the share of household income local residents are accustomed to dedicating to housing costs each month. At one extreme, some places with low housing costs might appear to be very affordable, but incomes might also be much lower than elsewhere; at the other extreme, some places that appear to be extremely expensive when looking at prices, might be more manageable as a result of relatively high wages and salaries. By combining Zillow data on home values, rents, and historical housing-cost burdens with data on incomes by occuption from the United States Census Bureau's American Community Survey, we can compare housing affordability for specific types of workers in different communities across the country. In this example, we estimate the share of a household's income that goes to a monthly mortgage payment on the median home across the country's metro areas. ","Software":"R","Dataset":"U.S. Census Bureau's (American Community Survey) ","Collaboration":null,"Tutorial":"http:\/\/commercedataservice.github.io\/tutorial_zillow_acs\/","Unnamed: 13":null,"Unnamed: 14":null,"Unnamed: 15":null,"Unnamed: 16":null},{"num":8,"Record Name":"uspto","Title":"Exploring the landscape of American Innovation","Authors":"Christopher Berman","Author Organization":"USPTO","Editors":"Star Ying","Editor Organization":"Commerce Data Service","Short Description":"What trends are emerging in intellectual property across the US?","Long Description":"Among the vast set of data that the USPTO provides, the Patent Technology Monitoring Team (PTMT) produces aggregations of the underlying patent data, along multiple, different dimensions and partitions. These aggregations answer a host of questions for us, including questions related to trends in technology and innovation in any given sector. \rAs part of the Commerce Data Usability Project and in collaboration with the Commerce Data Service, the USPTO created a tutorial introducing Tableau as a way to explore USPTO data. In essence, Tableau makes it easy to develop visualizations in order to quickly identify the changes in data. A series of visualizations powered by Tableau and USPTO data, for example, reveals new insights into how innovation varies across the United States, state by state. In California more patents are granted for technology innovations, but in Alaska, more patents are granted for oil drilling. ","Software":"Python, Tableau","Dataset":"Patent Trademark Monitoring Team Data Aggregations (PTMT) ","Collaboration":null,"Tutorial":"http:\/\/commercedataservice.github.io\/tutorial_pto\/","Unnamed: 13":null,"Unnamed: 14":null,"Unnamed: 15":null,"Unnamed: 16":null},{"num":9,"Record Name":"ms powerbi 1","Title":"Census Schooling Data with Power BI","Authors":"Adam Hechtman","Author Organization":"Microsoft","Editors":"Jeff Chen, Star Ying","Editor Organization":"Commerce Data Service","Short Description":null,"Long Description":"Data analysis using open government data has taken the center stage for everything from community organizing to starting or growing a business to crafting good public policy. Many government entities - federal, state, and local - have made open data a cornerstone of their transparency initiatives. But opening data to the public is just the first step to driving knowledge and insights in using that data. People need easy to use tools to help them discover, combine, analyze, and visualize that data. This three part tutorial will cover how to use the free version of the Power BI tool to ask questions using open federal and local data sources. ","Software":"PowerBI","Dataset":"2010 Census of Governments","Collaboration":null,"Tutorial":"https:\/\/github.com\/CommerceDataService\/tutorial_ms_powerbi","Unnamed: 13":null,"Unnamed: 14":null,"Unnamed: 15":null,"Unnamed: 16":null}]